Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱིས་ཁམས་ནི་མི་ཤེས། ཡིད་ཀྱི་ཁམས་ལ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མི་ཤེས་སོ། །
en: They know that the mind consciousness does not perceive the mind element, and the mind element does not perceive the mind consciousness.

source: དེ་ཡང་རྒྱུ་དང་རྐྱེན་མང་པོ་འདུས་པ་དང་ཕྱིན་ཅི་ལོག་ལས་སྐྱེ་ཞིང་འབྱུང་སྟེ།
en: They understand that it is born from a combination of many causes and conditions, which arise from mistaken perception; in other words,

source: ཡིད་ཐོག་མར་འགྲོ་བས་རྒྱུ་དང་རྐྱེན་གཉིས་འདུས་པ་ལས་འབྱུང་བར་ཤེས་སོ། །
en: it arises from a combination of both causes and conditions, preceded by the mind.

source: ཡང་དག་པ་མ་ཡིན་པ་ལ་ཆགས་པ་དང་ཀུན་བརྟགས་པ་ལས་སྐྱེས་ཏེ། སེམས་ཅན་ལ་རྣམ་པར་ཤེས་པའི་མཚན་མ་བསྟན་པའི་ཕྱིར་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཞེས་བརྗོད་དོ། །
en: The mind-consciousness element is thus taught because it demonstrates to beings the marks of consciousness, which are attached to falsity and are born from imputation.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་འདས་པ་ལ་མི་གནས། མ་འོངས་པ་ལ་མི་གནས། ད་ལྟར་ལ་མི་གནས་སོ། །
en: The mind consciousness does not exist in the past, present, or future.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་གང་ནས་ཀྱང་མ་འོངས་ལ། གང་དུའང་མ་སོང་། གནས་པའི་གནས་མེད་དེ།
en: The mind consciousness does not come from anywhere, go anywhere, or remain in any place.

source: ཐོག་མ་ནས་མ་སྐྱེས་པའི་མཚན་ཉིད་དོ། །
en: It has the characteristic of being primordially unborn.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་ཐོག་མའི་དངོས་པོར་ངེས་པའི་ཆོས་མེད་དོ། །
en: In the mind consciousness there is nothing with an inherent, fixed existence.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་མཚན་མ་གཉིས་སུ་མེད་དེ་མཚན་མ་མེད་པའོ། །
en: The mind-consciousness element has the mark of nonduality, which is to say, it is free of marks.

source: མཚན་མ་དེ་ནི་མཚན་མ་གཉིས་ཀྱི་ཕྱིར་ཡོད་པ་མ་ཡིན་ཏེ།
en: That mark does not exist on account of dualistic marks;

source: བསྟན་དུ་མེད་པ་ཉིད་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སོ། །
en: this indemonstrability is itself the mind-consciousness element.

source: མཁས་པ་དག་ནི་དེ་ལྟར་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་ནས་
en: Once the wise realize and understand the mind-consciousness element in this way,

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དེ་ཆོས་ཐམས་ཅད་ལ་མི་གནས། ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་ཏེ། ཆོས་ཐམས་ཅད་དང་གཅིག་པའམ་ཐ་དད་པ་མ་ཡིན་པར་རྟོགས་སོ། །
en: they understand that the mind-consciousness element cannot be found in any phenomenon, object, or location; it is neither the same as nor different from any phenomenon.

source: འཕགས་པ་རྣམས་ཀྱིས་མ་སྐྱེས་པ་ཉིད་ལ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་རྟོགས་སོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་འོངས་པ་མེད་སོང་བ་ཡང་མེད། དམིགས་པ་ཡང་མེད་དོ། །
en: “The noble ones realize that the mind-consciousness element is unborn, does not come, does not go, and cannot be observed.

source: དོན་དམ་པ་ལ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་མི་དམིགས།
en: Because on the ultimate level, the mind-consciousness element cannot be observed;

source: དམིགས་སུ་མེད། བསྟན་དུ་མེད་པའི་ཕྱིར་རོ། །
en: it is imperceptible and indemonstrable.

source: མཁས་པ་དག་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་བྱེད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་མ་བྱས་པ་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་རྟོགས།
en: Because the wise do not observe the mind-consciousness element to have a function, they understand the mind-consciousness element to be uncreated.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་སྐྱེ་བའི་མཚན་མ་མེད་པའི་ཕྱིར་མ་སྐྱེས་པར་ཆུད་ཅིང་རྟོགས་སོ། །
en: Because the mind-consciousness element lacks the mark of birth, they understand and realize it to be unborn.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་དེ་ལྟར་རྣམ་པར་འབྱེད་ཅིང་རྟོགས་སོ། །
en: Lokadhara, this is how bodhisattva great beings discern and understand the mind-consciousness element.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་རྟོག་པའི་ཚེ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ལ་མ་སྐྱེས་པ་ཉིད་དང་། ཅིའང་མེད་པ་ཉིད་དུ་རྣམ་པར་འབྱེད་ཅིང་རྟོགས་སོ། །
en: “When bodhisattvas contemplate the three realms, they discern and understand the desire realm, the form realm, and the formless realm to be unborn and nonexistent.

source: ཇི་ལྟར་རྟོག་ཅེ་ན།
en: How do they contemplate them?

source: འདི་ལྟ་སྟེ།
en: They think as follows:

source: འདོད་པའི་ཁམས་ལ་འདོད་པའི་ཁམས་མེད།
en: ‘There is no desire realm in the desire realm.

source: གཟུགས་ཀྱི་ཁམས་ལ་གཟུགས་ཀྱི་ཁམས་མེད།
en: There is no form realm in the form realm.

source: གཟུགས་མེད་པའི་ཁམས་ལ་གཟུགས་མེད་པའི་ཁམས་མེད་དེ།
en: There is no formless realm in the formless realm. However,

source: ཁམས་ཀྱིས་ཁམས་མེད་པའི་ཆོས་སྟོན་པས་
en: by using realms to demonstrate those phenomena that are devoid of a realm,

source: འདོད་པའི་ཁམས་ལ་འཇུག་པར་དགའ་བ་ལ་ནི་འདོད་པའི་ཁམས་སྟོན་ཏོ། །
en: the desire realm is shown to those who prefer to enter the desire realm,

source: གཟུགས་ཀྱི་ཁམས་ལ་འཇུག་པར་དགའ་བ་ལ་ནི་གཟུགས་ཀྱི་ཁམས་སྟོན་ཏོ། །
en: the form realm is shown to those who prefer to enter the form realm, and

source: གཟུགས་མེད་པའི་ཁམས་ལ་འཇུག་པར་དགའ་བ་ལ་ནི་གཟུགས་མེད་པའི་ཁམས་སྟོན་ཏོ། །
en: the formless realm is shown to those who prefer to enter the formless realm.

source: ཁམས་ཀྱིས་ཁམས་མེད་པ་མཚོན་ཅིང་བརྗོད་དོ། །
en: The absence of realms is indicated and articulated by using realms.

source: མཁས་པ་དག་ནི་ཅིའང་མེད་པའི་ཁམས་ནི་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་ཤེས་སོ། །
en: The wise understand the desire realm, the form realm, and the formless realm to be utterly nonexistent realms.

source: མཁས་པ་དག་ནི་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་མི་དམིགས་སོ། །
en: The wise do not observe the desire realm, the form realm, or the formless realm.

source: ཁམས་གསུམ་ཡང་དངོས་པོ་མེད་པ་ངེས་པའི་ཆོས་མེད་དེ་རྒྱུ་དང་རྐྱེན་མང་པོ་ལས་སྐྱེས་པར་ཤེས་པས་
en: By understanding that the three realms are devoid of inherent existence and fixed qualities, but arise from many causes and conditions,

source: དེ་བས་ན་མཁས་པ་དག་ནི་ཁམས་མེད་པ་ལ་ཁམས་གསུམ་དུ་ཤེས་སོ། །
en: the wise thus understand the three realms to be nonrealms.

source: དེ་ལ་ཁམས་མེད་དེ།
en: There are no realms, but

source: ཁམས་གསུམ་ཆར་ཡང་ཡང་དག་པ་མ་ཡིན་པ་ཕྱིན་ཅི་ལོག་གིས་འགྲོའོ། །
en: the three realms manifest due to falsity and mistaken perception.

source: མཁས་པ་དག་ནི་ཁམས་གསུམ་དུ་མི་དམིགས་པས།
en: Since the wise do not observe the three realms,

source: ཁམས་གསུམ་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་གྱིར་མི་དམིགས་མི་བརྗོད་དོ། །
en: the three realms cannot be observed or described as belonging to the past, present, or future.

source: འཕགས་པ་རྣམས་ཀྱིས་ནི་ཁམས་གསུམ་ལ་ཡང་དག་པ་མ་ཡིན་པ་དང་། ཅི་ཡང་མེད་པར་རང་བཞིན་མེད་པ། ཆོས་རྣམས་དང་བྲལ་བ། ཕྱིན་ཅི་ལོག་ལས་བྱང་བར་རྟོགས་ཏེ།
en: The noble ones understand the three realms to be false, nonexistent, devoid of intrinsic nature, free of all phenomena, and arisen from mistaken perception.

source: སྐྱེ་བོ་མང་པོའི་ཕྱིན་ཅི་ལོག་ཡོངས་སུ་གཅད་པའི་ཕྱིར། ཁམས་གསུམ་ཤེས་ཤིང་མཐོང་བར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་ཕྱེ་སྟེ་གསུངས་སོ། །
en: The Thus-Gone One distinguishes between and explains them in order to disrupt the mistaken perception of many beings and enable them to see and understand the three realms.

source: ཁམས་གསུམ་གྱི་དངོས་པོ་བསྟན་པ་ཡང་སེམས་ཅན་དག་ཁམས་མེད་པའི་དོན་ཤེས་པར་བྱ་བའི་ཕྱིར་ཁམས་གསུམ་གསུངས་ཏེ་ཁམས་ཀྱི་དངོས་པོར་མ་ཡིན་ནོ། །
en: The teaching on the existence of the three realms, moreover, describes the three realms so that beings can understand the meaning of nonrealm; for in truth, they are not actual realms.

source: མཁས་པ་དག་ནི་ཁམས་གསུམ་ནི་ཁམས་མེད་པར་ཤེས་ཤིང་རྟོགས་སོ། །
en: The wise understand and realize the three realms to be nonrealms.’

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་ལྟར་རྟོག་པའི་ཚེ་སེམས་ཅན་གྱི་ཁམས་དང་བདག་གི་ཁམས་ནི་ནམ་མཁའི་ཁམས་ཏེ།
en: “Lokadhara, when bodhisattva great beings contemplate in this way, they understand others’ elements and their own elements to be the element of space, for

source: ཆོས་ཀྱི་ཁམས་མེད་པ་དང་། ཅིའང་མེད་པའི་ཁམས་དང་། མ་སྐྱེས་པའི་ཁམས་སུ་རྟོགས་སོ། །
en: they understand them to be the nonexistent mental-object element, the element of nonexistence, and the unborn element.

source: སེམས་ཅན་གྱི་ཁམས་དང་། བདག་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་བྱེ་བྲག་མེད་དེ་ཐ་མི་དད་དོ། །
en: Their own elements and others’ elements are not different or distinct from the element of space.

source: ཁམས་ཀྱི་མཚན་ཉིད་དེ་དག་ཀྱང་ཡང་དག་པ་མ་ཡིན་པ་ལས་བྱུང་སྟེ།
en: All such elements emerge from space, but

source: རྐྱེན་མང་པོ་ལས་སྐྱེས་པས་ཁམས་ཞེས་བྱ་སྟེ་དེ་ལ་ངེས་པའི་ཁམས་མེད་དོ། །
en: since they are born from many conditions, they are known as elements , as there is no fixed characteristic of elements among them.

source: ནམ་མཁའ་ལ་གཅིག་ཏུ་ངེས་པའི་ཁམས་མེད་དོ། །
en: It is because space has no definitive element.

source: མཚན་ཉིད་དེ་དག་ཀྱང་ནམ་མཁའི་ཁམས་སུ་རྟོགས་པས་ཁམས་མེད་པའི་དོན་ཏོ། །
en: Given that all characteristics are included in the element of space, this is the meaning of the absence of realms.

source: ནམ་མཁའ་ལ་ཁམས་མེད་པ་བཞིན་དུ་ཆོས་ཀྱང་མཐར་མཚན་མ་དང་བྲལ་ཏེ་མེད་པའི་མཚན་ཉིད་དོ། །
en: Just as space has no elements, phenomena too are ultimately without marks and have the characteristic of nonexistence.

source: ཁམས་ཐམས་ཅད་ཀྱང་ཁམས་དང་བྲལ་བའོ། །
en: All elements are free from elements.

source: ཁམས་ལ་ཁམས་མེད་དེ།
en: Since there is no element in an element,

source: ཁམས་ཞེས་བྱ་བ་ནང་ན་མི་གནས། ཕྱི་རོལ་ན་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་ཏེ།
en: elements do not exist internally, externally, or somewhere in-between.

source: ཁམས་ཀྱི་ནང་ན་ཁམས་མེད་དོ། །
en: There is no element within an element.

source: མེད་པ་ནི་མཚན་ཉིད་དུ་མ་བསྡུས་པ། ཁམས་ལ་མི་གནས་པའོ། །
en: That absence is not included among characteristics and does not depend on an element.

source: ཁམས་ཐམས་ཅད་ལ་གནས་མེད།
en: All elements are devoid of a locus.

source: ཁམས་ཐམས་ཅད་ནི་མ་སྐྱེས་པའོ། །
en: All elements are unborn.

source: མཁས་པ་དག་ནི་ཁམས་ཀྱི་རྣམས་ལ་ཁམས་སྐྱེ་བར་མི་དམིགས།
en: The wise do not observe elements arising, ceasing, or abiding in the elements.

source: ཁམས་ལ་འགོག་པར་མི་དམིགས། ཁམས་ལ་གནས་པར་མི་དམིགས་སོ། །ཁམས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ། མ་བྱུང་བ། མི་གནས་པ། ཐོག་མ་ནས་དམིགས་སུ་མེད་པའོ། །
en: All elements are unborn, unarisen, nonabiding, and primordially unobservable.

source: མཁས་པ་དག་ནི་མིང་ཙམ་དུ་བཏགས་པའི་ཁམས་ལ་མི་ཆགས། ཆགས་པར་མི་བྱེད། མི་འཛིན། མི་རྟོག་གོ། །
en: The wise do not become attached to elements, which are mere labels. They do not become attached to, grasp at, or conceptualize them.

source: དེ་བས་ན་མཁས་པ་དག་ནི་ཁམས་ཐམས་ཅད་ལ་ཁམས་མ་སྐྱེས་པར་ཤེས་ཤིང་མཐོང་སྟེ།
en: Therefore, the wise see and understand all elements to be unborn elements.

source: མ་སྐྱེས་པས་ན་འགོག་པ་མེད་དེ།
en: Since all elements are unborn, they are unceasing; thus,

source: དོན་དམ་པ་ལ་ཁམས་ཐམས་ཅད་དམིགས་སུ་མེད་དོ། །
en: on the ultimate level, no element can be observed.

source: ཀུན་རྫོབ་ཏུ་ན་ཆོས་ཀྱི་ཁམས་རྣམས་རྣམ་པར་ཕྱེ་སྟེ་བརྗོད་དོ། །
en: Relatively, mental-object elements are distinguished and discussed, but

source: དོན་དམ་པར་ནི་ཁམས་སུ་བརྗོད་པ་ཡང་མེད་དོ། །
en: on the ultimate level there is nothing at all that can be described as an element .

source: མཁས་པ་དག་ནི་ཁམས་ཐམས་ཅད་དོན་དམ་པའི་དོན་དུ་ཤེས་ཤིང་རྟོགས་སོ། །
en: Thus do the wise understand and realize the definitive meaning of all elements.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་ལྟར་ཁམས་བཅྭ་བརྒྱད་དང་། ཁམས་གསུམ་དང་། སེམས་ཅན་གྱི་ཁམས་དང་། བདག་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་རྟོགས་ཤིང་རྣམ་པར་ཕྱེ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Lokadhara, thus do bodhisattva great beings contemplate, analyze, and understand the eighteen elements, the three realms, others’ elements, their own elements, and the element of space.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པའི་ཚེ་ཁམས་སུ་མི་དམིགས། ཁམས་སུ་མི་མཐོང་།
en: When bodhisattvas thus understand and realize them, they do not observe or view elements.

source: ཐམས་ཅད་ཀྱི་མིང་ཡང་རྟོགས་ཤིང་ཁམས་ཐམས་ཅད་ཁམས་མེད་པར་འཇུག་པ་ལ་ཡིད་ཆེས་སོ། །
en: They understand all their terminology and have confidence in an understanding of all elements as nonelements.

source: ཁམས་སུ་རྣམ་པར་ཕྱེ་བ་ཡང་ཤེས་ཤིང་ཀུན་རྫོབ་ཏུ་ཁམས་ཐམས་ཅད་རྣམ་པར་ཕྱེ་ནས་ཁམས་ཐམས་ཅད་དོན་དམ་པར་ཞུགས་པར་ཡང་ཤེས།
en: Understanding the differentiation into elements and differentiating them on the relative level enables them to understand how all elements appear on the ultimate level.

source: ཁམས་མེད་པའི་སྦྱོར་བ་ཡང་ཤེས་ཤིང་སེམས་ཅན་རྣམས་ལ་ཁམས་རྣམས་རྣམ་པར་སྟོན་ཏེ། སེམས་ཅན་རྣམས་ཁམས་ཀྱི་སྦྱོར་བ་ལ་ཤིན་ཏུ་གནས་པར་ཡང་བྱེད་དོ། །
en: Understanding the application of the nonexistence of the elements, and thus teaching beings the elements, enables them to ground beings in the application of the elements.

source: ཀུན་རྫོབ་ཏུ་ཚིག་དང་སྨྲ་བས་སེམས་ཅན་རྣམས་ལ་ཁམས་མེད་པའི་ཆོས་སྟོན་ཀྱང་མཚན་མ་གཉིས་སུ་ཁམས་མི་སྟོན་ཏོ། །
en: Even though, on the relative level, they use words and speech to teach beings about phenomena being devoid of elements, they do not teach that elements have dualistic marks.

source: ཁམས་ཐམས་ཅད་གཉིས་སུ་མེད་ཀྱང་ཐབས་ཀྱིས་ཁམས་ཀྱི་རྣམས་རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བར་སྟོན་ཏོ། །
en: Even though all elements are nondual, they use skillful means to show that the elements are dependently originated.

source: ཀུན་རྫོབ་ཏུ་ཚིག་དང་སྨྲ་བས་སེམས་ཅན་རྣམས་སྨིན་པར་བྱེད་ཀྱང་སེམས་ཅན་རྣམས་ལ་དོན་དམ་པ་སྟོན་ཏོ། །
en: Even though on the relative level they use words and speech to ripen beings, they teach the ultimate to beings.

source: ཁམས་ཀྱི་ཁྱད་པར་གྱི་རྣམ་པ་ལ་ཁམས་ཀྱང་ཁམས་ཐམས་ཅད་མེད་པར་ཡིད་ཆེས་ཤིང་རྟོགས་སོ། །
en: Even though they are learned with regard to the distinct features of the elements, they trust and understand that all elements are nonexistent.

source: འཇིག་རྟེན་འཛིན་དེ་བཞིན་གཤེགས་པ་དོན་དམ་པས་ཁམས་སུ་མི་དམིགས། ཁམས་ཀྱི་ཆོས་སུ་མི་དམིགས་སོ། །
en: Lokadhara, on the ultimate level, the Thus-Gone One does not observe elements or any qualities of elements.

source: འཇིག་རྟེན་འཛིན་ངས་ནི་ཁམས་ཐམས་ཅད་འགགས་པའང་མེད། བཅད་པ་ཡང་མེད་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །
en: “Lokadhara, I fully awakened to unsurpassed and perfect buddhahood without rejecting or disrupting any elements.

source: དོན་དམ་པ་ལ་ཁམས་རྣམས་མེད་དོ། །
en: On the ultimate level, there are no elements.

source: ཁམས་ཐམས་ཅད་ལ་ཁམས་གང་ཡང་མེད་དེ་ངེས་པ་མེད་དོ། །
en: There are no elements, or any actuality, in any elements.

source: ཁམས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་སྟེ།
en: All elements are the same as space;

source: ཁམས་ཐམས་ཅད་ནམ་མཁར་འཇུག་པས་ཁམས་ཐམས་ཅད་མ་སྐྱེས་པའི་མཚན་ཉིད་དོ། །
en: so since all elements are included in space, all elements are characterized as being unborn.

source: དེ་བཞིན་གཤེགས་པས་ཁམས་ཐམས་ཅད་ལ་དེ་ལྟ་བུའི་ཚུལ་གྱིས་ཐུགས་སུ་ཆུད་དོ། །
en: The Thus-Gone One understands all the elements in this manner.

source: དེ་བཞིན་གཤེགས་པས་ཁམས་སུ་མ་གསུངས་ཆོས་རྣམས་ཀྱི་སྟོབས་ཀྱང་མ་གསུངས་སོ། །
en: Lokadhara, the Thus-Gone One did not speak of any elements or even the power of phenomena.

source: ཆོས་ཐམས་ཅད་ཅི་ཡང་མེད་པས་ཅིའང་མེད་པའི་ཁམས་མི་གསུང་ངོ་། །
en: As no phenomenon whatsoever exists, he should not speak of nonexistent elements.

source: འཇིག་རྟེན་འཛིན་དེ་བཞིན་གཤེགས་པས་ནི་ཅིའང་མེད་པའི་ཁམས་གསུངས་མོད་ཀྱི་དེ་ལ་ཡང་དག་པར་ན་ཁམས་སུ་གསུངས་པ་མེད་དེ།
en: Nonetheless, Lokadhara, although the Thus-Gone One has indeed spoken of nonexistent elements, in truth, there are no elements to speak of.

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ན་ཁམས་རྣམས་ཀྱི་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Lokadhara, this is called skill in discerning the elements .

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཁམས་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཁམས་ཐམས་ཅད་བཏགས་པ་ཙམ་དུ་ཤེས་པ་དང་། ཀུན་རྫོབ་ཀྱི་ཁམས་ཙམ་དུ་ཤེས་པ་དང་། དོན་དམ་པའི་ཁམས་ཤེས་པ་དང་། ཁམས་ཀྱི་ངེས་པ་ཤེས་པ་དང་། ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཤེས་པ་དང་། ཁམས་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་དང་། ཅི་དང་ཅི་ལྟ་བུ་དང་ལྡན་པར་ཤེས་པ་དང་།
en: Bodhisattva great beings are skilled in discerning the elements, understand all elements to be mere labels, understand them as mere relative elements, understand the ultimate element, understand the ascertainment of the elements, understand the relative truth, are skilled in discerning the elements, understand what their particular qualities are, [understand the gathering of elements, understand the engagement with the elements, understand the engagement with the elements of truth, are skilled in the distinctions of the elements, understand all elements to be nonelements, understand all elements to be equivalent to the element of space, do not make distinctions among the elements, do not observe distinctions among elements, and do not express any such distinctions.]

source: ཁམས་ཀྱི་འདུས་པ་ཤེས་པ་དང་། ཁམས་ཀྱི་འཇུག་པ་ཤེས་པ་དང་། བདེན་པའི་ཁམས་ཀྱི་འཇུག་པ་ཤེས་པ་དང་། ཁམས་ཀྱི་ཁྱད་པར་ལ་མཁས་པ་དང་། ཁམས་ཐམས་ཅད་ཁམས་མེད་པར་ཤེས་པ་དང་། ཁམས་ཐམས་ཅད་ནམ་མཁའི་ཁམས་དང་འཐུན་པར་ཤེས་ཏེ་
en: [Bodhisattva great beings are skilled in discerning the elements, understand all elements to be mere labels, understand them as mere relative elements, understand the ultimate element, understand the ascertainment of the elements, understand the relative truth, are skilled in discerning the elements, understand what their particular qualities are, ]understand the gathering of elements, understand the engagement with the elements, understand the engagement with the elements of truth, are skilled in the distinctions of the elements, understand all elements to be nonelements, understand all elements to be equivalent to the element of space, [do not make distinctions among the elements, do not observe distinctions among elements, and do not express any such distinctions.]

source: ཁམས་རྣམས་ལ་བྱེ་བྲག་ཏུ་མི་འབྱེད་པ་དང་། ཁམས་རྣམས་ལ་བྱེ་བྲག་ཏུ་མི་དམིགས། བྱེ་བྲག་ཏུ་མི་བརྗོད་དོ། །
en: [Bodhisattva great beings are skilled in discerning the elements, understand all elements to be mere labels, understand them as mere relative elements, understand the ultimate element, understand the ascertainment of the elements, understand the relative truth, are skilled in discerning the elements, understand what their particular qualities are, understand the gathering of elements, understand the engagement with the elements, understand the engagement with the elements of truth, are skilled in the distinctions of the elements, understand all elements to be nonelements, understand all elements to be equivalent to the element of space, ]do not make distinctions among the elements, do not observe distinctions among elements, and do not express any such distinctions.

source: སེམས་ཅན་རྣམས་ལ་ཁམས་འཇིག་པ་སྟོན་པ་ལ་མཁས་པར་འགྱུར་རོ། །
en: They become skilled in teaching beings about the destruction of the elements.

source: འཇིག་རྟེན་འཛིན་འདི་ལྟ་སྟེ། སྒྱུ་མ་མཁན་མཁས་པ་ཞིག་སེམས་ཅན་ལ་སྒྱུ་མ་རྣམ་པ་སྣ་ཚོགས་བསྟན་ཏེ། སྒྱུ་མའི་དངོས་པོ་རྣམ་པ་སྣ་ཚོགས་ཤེས་པར་བྱེད་དོ། །
en: Lokadhara, a skilled magician can show beings various illusions, enabling them to experience various illusory entities.

source: དེ་ལ་མཛའ་ཞིང་བཤེས་པ་དག་གིས་འདི་སྐད་དུ་འདི་ནི་སྒྱུ་མའོ། །སྒྱུ་མར་བྱས་པའི་དངོས་པོ་སྟེ། སྒྱུ་མ་དེ་ལ་ཡང་དག་པ་མེད་དོ། །ཕྱིན་ཅི་ལོག་ཏུ་སེམས་ཅན་ལ་སྟོན་ཏོ་ཞེས་སྨྲས་ན་
en: However, a relative or friend might tell them, ‘This is an illusion; these entities are magically created. This illusion is not real. It only appears to beings as a mistaken perception.’ In that case,

source: མཁས་པ་དག་ནི་སྒྱུ་མར་ཤེས་པར་འགྱུར་རོ། །
en: any wise person would understand them to be illusions.

source: འཇིག་རྟེན་འཛིན་འཇིག་རྟེན་གྱི་རང་བཞིན་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: “Lokadhara, the nature of the world is like an illusion.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྒྱུ་མ་ལྟ་བུའི་ཆོས་ལ་ཞུགས་ན་འཇིག་རྟེན་སྒྱུ་མའི་རང་བཞིན་དུ་ཤེས་སོ། །
en: If bodhisattvas understand illusory phenomena, they understand the world’s illusory nature.

source: འཇིག་རྟེན་སྤྱོད་པ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: The ways of the world are like an illusion, and

source: སྦྱོར་བའི་སྟོབས་ཀྱིས་སེམས་ཅན་དག་ལ་འཇིག་རྟེན་སྒྱུ་མ་ལྟ་བུར་སྟོན་ཏོ། །
en: through the power of magic, the world magically appears to beings.

source: གང་ཞིག་འཇིག་རྟེན་ལ་ཡང་དག་པའི་བདེན་པར་འཛིན་ན་འཇིག་རྟེན་ཡང་དག་པ་མ་ཡིན་པ་སྒྱུ་མ་ལྟ་བུར་སྟོན་ཏོ། །
en: If someone clings to the world as truly real, bodhisattvas show them that the world is false and illusory.

source: དེ་ལ་མཁས་པ་བློ་ཟབ་མོ་དབང་པོ་རྣོ་བ་དག་ནི་ཟུར་ཙམ་བསྟན་པས་
en: Once the wise who have profound intelligence and sharp faculties are shown just a facet of this,

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། མི་བདེན་པ་དངོས་པོ་མེད་པར་ཤེས་ཏེ།
en: they understand all phenomena to be emptiness, illusory, unreal, and insubstantial;

source: ཆོས་ཐམས་ཅད་ཀྱིས་བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་བསླུས་པ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པའི་རྐྱེན་ལ་རག་ལུས་པར་ཤེས་སོ། །
en: they understand that all phenomena deceive childish ordinary beings, and that they depend upon false conditions.

source: འཇིག་རྟེན་འཛིན་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཁམས་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པར་འདོད་པ་དག་ཤིན་ཏུ་ཟབ་མོའི་མདོ་སྡེ་བརྗོད་དུ་མེད། དམིགས་སུ་མེད་པ། ཁམས་ཐམས་ཅད་ཤེས་ཤིང་མཐོང་བར་བྱེད་པ་སྟོན་པ། ཁམས་ཐམས་ཅད་ཡི་གེ་མེད་པ། འདུས་པ་མེད་པ། བརྗོད་དུ་མེད་པ། ཁམས་ཐམས་ཅད་ཀྱི་ཐབས་དང་ཤེས་རབ་སྟོན་པ། རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བ་ལ་འཇུག་པར་བྱེད་པ་སྟོན་པ། གཞན་ཡང་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པ་ཉིད་བརྗོད་པ།
en: “Therefore, Lokadhara, bodhisattva great beings who wish to understand the function of the elements [should exert themselves in ]such extremely profound, indescribable, and unobservable discourses as these, which teach the understanding and knowledge of all elements, describe all elements to be beyond words and beyond formation, teach the means and insight related to all elements, teach how the elements are dependently originated, and, moreover, express the true reality of all phenomena. [Such bodhisattvas should exert themselves, namely, in all the statements of the profound discourses that teach worldliness and transcendence, the conditioned and unconditioned, what it is to be fettered and not fettered, the aim of practice, and the meaning of the relative and the ultimate, along with discourses on the definitive meaning, discourses on the inferred meaning, and the liberating discourses on dependent origination.”]

source: འདི་ལྟ་སྟེ། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་པ་དང་། དབང་དང་དབང་མ་ཡིན་པ་དང་། སྤྱོད་པ་ལ་འཇུག་པ་དང་། དོན་དམ་པ་དང་ཀུན་རྫོབ་ཀྱི་དོན་དང་། ངེས་པའི་དོན་གྱི་མདོ་སྡེ་དང་། བཀྲི་བའི་དོན་གྱི་མདོ་སྡེ་དང་། རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བའི་རྣམ་པར་གྲོལ་བའི་མདོ་སྡེ་ཟབ་མོ་འདི་ལས་བརྗོད་པ་ཐམས་ཅད་ལ་བརྩོན་པར་བྱའོ། །
en: [“Therefore, Lokadhara, bodhisattva great beings who wish to understand the function of the elements ]should exert themselves in [such extremely profound, indescribable, and unobservable discourses as these, which teach the understanding and knowledge of all elements, describe all elements to be beyond words and beyond formation, teach the means and insight related to all elements, teach how the elements are dependently originated, and, moreover, express the true reality of all phenomena.] Such bodhisattvas should exert themselves, namely, in all the statements of the profound discourses that teach worldliness and transcendence, the conditioned and unconditioned, what it is to be fettered and not fettered, the aim of practice, and the meaning of the relative and the ultimate, along with discourses on the definitive meaning, discourses on the inferred meaning, and the liberating discourses on dependent origination.”

source: ཁམས་བཅྭ་བརྒྱད་ཅེས་བྱ་བའི་ལེའུ་སྟེ་གསུམ་མོ།། །།
en: This was chapter three:“ The Eighteen Elements .”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་འཛིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One continued addressing Lokadhara:

source: དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེ་མཆེད་བཅུ་གཉིས་ལ་མཁས་པ་ཞེ་ན།
en: “How are bodhisattva great beings knowledgeable about the twelve sense sources?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྐྱེ་མཆེད་བཅུ་གཉིས་རྣམ་པར་འབྱེད་ཅིང་ཡང་དག་པར་རྟོག་པ་ན་འདི་སྙམ་དུ་མིག་ལ་མིག་གི་སྐྱེ་མཆེད་དམིགས་སུ་མེད།
en: When discerning the twelve sense sources, they think, ‘The eye sense source cannot be observed in the eye.

source: མིག་ལ་མིག་གི་སྐྱེ་མཆེད་དུ་ངེས་པ་མེད་དོ། །
en: In the eye, there is no definitive eye sense source.

source: མིག་གི་སྐྱེ་མཆེད་ཀྱང་དངོས་པོར་དམིགས་སུ་མེད་དོ། །
en: The eye sense source cannot be observed to be an entity.’
